# Filtering, Ordering, and Limiting Data with SQL - Lab done by `Eugene Maina`

## Introduction
In this lab, you will practice writing SQL `SELECT` queries that limit results based on conditions, using `WHERE`, `ORDER BY`, and `LIMIT`.

## Objectives
You will practice the following:

* Order the results of your queries by using `ORDER BY` (`ASC` & `DESC`)
* Limit the number of records returned by a query using `LIMIT`
* Write SQL queries to filter and order results

## The Data

Here's a database full of famous dogs!  The `dogs` table is populated with the following data:

|name      |age    |gender |breed           |temperament|hungry |
|----------|-------|-------|----------------|-----------|-------|
|Snoopy    |3      |M      |beagle          |friendly   |1      |
|McGruff   |10     |M      |bloodhound      |aware      |0      |
|Scooby    |6      |M      |great dane      |hungry     |1      |
|Little Ann|5      |F      |coonhound       |loyal      |0      |
|Pickles   |13     |F      |black lab       |mischievous|1      |
|Clifford  |4      |M      |big red         |smiley     |1      |
|Lassie    |7      |F      |collie          |loving     |1      |
|Snowy     |8      |F      |fox terrier     |adventurous|0      |
|NULL      |4      |M      |golden retriever|playful    |1      |

## Connecting to the Database

In the cell below, import `pandas` and `sqlite3`. Then establish a connection to the database `dogs.db`.

Look at all of the data in the table by selecting all columns from the `dogs` table with `pd.read_sql`.

In [15]:
# Your code here; imports, create a connection, select all

import sqlite3
import pandas as pd

conn = sqlite3.connect('dogs.db')
cursor = conn.cursor()

dogs = pd.read_sql('SELECT * FROM dogs', conn, index_col='id')
dogs

          name  age gender             breed  temperament  hungry
id
1       Snoopy    3      M            beagle     friendly       1
2      McGruff   10      M        bloodhound        aware       0
3       Scooby    6      M        great dane       hungry       1
4   Little Ann    5      F         coonhound        loyal       0
5      Pickles   13      F         black lab  mischievous       1
6     Clifford    4      M           big red       smiley       1
7       Lassie    7      F            collie       loving       1
8        Snowy    8      F       fox terrier  adventurous       0
9         None    4      M  golden retriever      playful       1

## Queries

Display the outputs for each of the following query descriptions.

### Select the name and breed for all female dogs

<details>
    <summary style="cursor: pointer; display: inline"><h4>Click for hint:</h4></summary>
    <p>Use <code>WHERE</code> with the <code>=</code> operator</p>
</details>

In [5]:
# Your code here

female_dogs = '''SELECT name, breed 
                    FROM dogs 
                    WHERE gender = "F"'''

female_dogs_df =  pd.read_sql(female_dogs, conn)

female_dogs_df

         name        breed
0  Little Ann    coonhound
1     Pickles    black lab
2      Lassie       collie
3       Snowy  fox terrier

### Select the number of dogs that do not have a name

<details>
    <summary style="cursor: pointer; display: inline"><h4>Click for hint:</h4></summary>
    <p>Use <code>COUNT</code> and <code>IS NULL</code></p>
</details>

In [8]:
# Your code here

no_name_dogs = '''SELECT COUNT(*)
                    FROM dogs
                    WHERE name IS NULL'''
no_name_dogs_df = pd.read_sql(no_name_dogs, conn)
no_name_dogs_df

   COUNT(*)
0         1

### Select the names of all dogs that contain the double letters `ff` or `oo`

<details>
    <summary style="cursor: pointer; display: inline"><h4>Click for hint:</h4></summary>
    <p>Use <code>LIKE</code>, <code>%</code>, and <code>OR</code></p>
</details>

In [9]:
# Your code here
contains_ff_or_oo = '''SELECT name
                        FROM dogs
                        WHERE name LIKE "%ff%" OR name LIKE "%oo%"'''
contains_ff_or_oo_df = pd.read_sql(contains_ff_or_oo, conn)
contains_ff_or_oo_df

       name
0    Snoopy
1   McGruff
2    Scooby
3  Clifford

### Select the names of all dogs listed in alphabetical order.  Notice that SQL lists the nameless dog first.

<details>
    <summary style="cursor: pointer; display: inline"><h4>Click for hint:</h4></summary>
    <p>Use <code>ORDER BY</code></p>
</details>

In [10]:
# Your code here
names_in_order = '''SELECT name
                    FROM dogs
                    ORDER BY name'''
names_in_order_df = pd.read_sql(names_in_order, conn)
names_in_order_df

         name
0        None
1    Clifford
2      Lassie
3  Little Ann
4     McGruff
5     Pickles
6      Scooby
7      Snoopy
8       Snowy

### Select the name and breed of only the hungry dogs and list them from youngest to oldest

In [14]:
# Your code here
hungry_dogs_in_age_order = '''SELECT name, age
                                FROM dogs
                                WHERE hungry = 1
                                ORDER BY age DESC'''

hungry_dogs_in_age_order_df = pd.read_sql(hungry_dogs_in_age_order, conn)
hungry_dogs_in_age_order_df

       name  age
0   Pickles   13
1    Lassie    7
2    Scooby    6
3  Clifford    4
4      None    4
5    Snoopy    3

### Select the oldest dog's name, age, and temperament

<details>
    <summary style="cursor: pointer; display: inline"><h4>Click for hint:</h4></summary>
    <p>Use <code>ORDER BY</code> with <code>LIMIT</code></p>
</details>

In [16]:
# Your code here
oldest_dog = '''SELECT name, MAX(age), temperament
                FROM dogs'''
oldest_dog_df = pd.read_sql(oldest_dog, conn)
oldest_dog_df

      name  MAX(age)  temperament
0  Pickles        13  mischievous

### Select the name and age of the three youngest dogs

In [18]:
# Your code here
three_youngest_dogs = '''SELECT name, age
                        FROM dogs
                        ORDER BY age ASC
                        LIMIT 3'''
three_youngest_dogs_df = pd.read_sql(three_youngest_dogs, conn)
three_youngest_dogs_df

       name  age
0    Snoopy    3
1  Clifford    4
2      None    4

### Select the name and breed of the dogs who are between five and ten years old, ordered from oldest to youngest

<details>
    <summary style="cursor: pointer; display: inline"><h4>Click for hint:</h4></summary>
    <p>Use <code>WHERE</code> with <code>BETWEEN</code></p>
</details>

In [ ]:
# Your code here

dogs_between_five_and_ten = '''SELECT name, breed, age
                                FROM dogs 
                                WHERE age BETWEEN 5 AND 10
                                ORDER BY age DESC'''

dogs_between_five_and_ten_df = pd.read_sql(dogs_between_five_and_ten, conn)
dogs_between_five_and_ten_df

         name        breed  age
0     McGruff   bloodhound   10
1       Snowy  fox terrier    8
2      Lassie       collie    7
3      Scooby   great dane    6
4  Little Ann    coonhound    5

### Select the name, age, and hungry columns for hungry dogs between the ages of two and seven.  This query should also list these dogs in alphabetical order.

In [22]:
# Your code here
hungry_dogs_between_two_and_seven = '''SELECT name, age, hungry
                                        FROM dogs
                                        WHERE hungry = 1 AND age BETWEEN 2 AND 7
                                        ORDER BY name'''
hungry_dogs_between_two_and_seven_df = pd.read_sql(hungry_dogs_between_two_and_seven, conn)
hungry_dogs_between_two_and_seven_df

       name  age  hungry
0      None    4       1
1  Clifford    4       1
2    Lassie    7       1
3    Scooby    6       1
4    Snoopy    3       1

## Close the Database Connection

In [23]:
# Your code here
cursor.close()

## Summary

Great work! In this lab you practiced writing more complex SQL statements to not only query specific information but also define the quantity and order of your results.